//работы с коллекциями массивов 
// методы
// - each - проходит по всему массиву по всей коллекции , вызывает другой метод 
           //(например alert) который может примениться (выполняется) к каждому элементу массива. 
    // _.each([1, 2 , 3], alert);
    //  a1 -  [1, 5, 17, 9] - это наш отладочный массив - исходные данные.  
    // _.each(a1, alert);

/*Исходные данные - each*/
let a1 = [1, 5, 17, 9],
    a2 = [
      {name: "Vasya", spec: "PHP", salary: 5e4},
      {name: "Anya",  spec: "SEO", salary: 3e4}
]; 

// - map - проход по всему массиву и создание нового массива.

// - reduce - объединение всех элементов массива по какой то формуле.

// - reduceRight

// - find - нахождение перового элеемента внутри коллекции или массива.

// - filter

// - where

// - findWhere

// - reject

// - every
// - some
// - contains
// - invoke
// - pluck
// - max
// - min
// - sortBy
// - groupBy
// - indexBy
// - countBy
// - shuffle
// - sample
// - toArray
// - size
// - partition
//массивы объектов имя, специальность, заработок
//_.each указываем массив, метод alert






